understanding/how_to_read_and_sequence_iso27001.md

# Table of Contents

    1.  [Clause 4 - Context of the organization](#org6acc312)
    2.  [Clause 5 - Leadership](#org800b27a)
    3.  [Clause 6 - Planning](#orgf1dff18)
    4.  [Clause 7 - Support](#org2df39db)
    5.  [Clause 8 - Operation](#orgf3f9060)
    6.  [Clause 9 - Performance Evaluation](#org9c3fa50)
    7.  [Clause 10 - Improvement](#org73898c6)
1.  [Annex A](#org80e92a7)



<a id="org6acc312"></a>

## Clause 4 - Context of the organization

Define drivers, stakeholders, and scope of the ISMS


<a id="org800b27a"></a>

## Clause 5 - Leadership

top leadership demonstrates commitment, assigns responsibility, and provides strategic direction


<a id="orgf1dff18"></a>

## Clause 6 - Planning

define security objectives and establish a risk management process for consistent risk assessment


<a id="org2df39db"></a>

## Clause 7 - Support

allocates resources, maintain competency, establish communication plans


<a id="orgf3f9060"></a>

## Clause 8 - Operation

plan, implement, and control ISMS processes, including risk assessment and treatment


<a id="org9c3fa50"></a>

## Clause 9 - Performance Evaluation

monitor and measure ISMS effectiveness trouhg audits and managemeent reviews


<a id="org73898c6"></a>

## Clause 10 - Improvement

identify opportunities for improvement and correct nonconformities


<a id="org80e92a7"></a>

# Annex A

As organizações selecionam controles &ldquo;dentro do escopo&rdquo; para mitigar os riscos identificados

Controles irrelevantes são marcados como &ldquo;fora do escopo&rdquo; com justificativa

Documentos de orientação

**ISO/IEC 27002:2022** ->

-   orientações de implementação para o Anexo A

**ISO/IEC 27003:2022** ->

-   orientações de implementação para as Cláusulas 4 a 10

O fluxo lógico auxilia no desenvolvimento de um plano de auditoria coeso

A compreensão dos requisitos e das orientações ajuda a identificar lacunas na implementação do SGSI (Sistema de Gestão de Segurança da Informação)

Seguir a sequência garante que os auditores possam identificar falhas nos requisitos que dificultam a melhoria durante a implementação ou em auditorias futuras

